package cn.gridx.scala.lang.test

import java.util
import java.util.Date

import com.google.gson.Gson
import org.joda.time.{DateTime, DateTimeZone}

import scala.collection.mutable.ArrayBuffer


/**
  * Created by tao on 2/23/16.
  */
object Test {

  val json =
    """
      {
      |"businessBrandList": [
      |        {
      |          "name": "山花",
      |          "id": 367
      |        },
      |        {
      |          "name": "蒙牛",
      |          "id": 279
      |        },
      |        {
      |          "name": "好一多",
      |          "id": 16970
      |        },
      |        {
      |          "name": "蒙牛冠益乳",
      |          "id": 10513
      |        },
      |        {
      |          "name": "圣牧",
      |          "id": 10707
      |        },
      |        {
      |          "name": "光明",
      |          "id": 12152
      |        },
      |        {
      |          "name": "家乡果园",
      |          "id": 12340
      |        },
      |        {
      |          "name": "子母",
      |          "id": 12536
      |        },
      |        {
      |          "name": "旺仔",
      |          "id": 11110
      |        },
      |        {
      |          "name": "天友",
      |          "id": 12201
      |        },
      |        {
      |          "name": "妙昔",
      |          "id": 13929
      |        },
      |        {
      |          "name": "强人键能",
      |          "id": 13025
      |        },
      |        {
      |          "name": "娃哈哈",
      |          "id": 100
      |        },
      |        {
      |          "name": "雪兰",
      |          "id": 13452
      |        },
      |        {
      |          "name": "茂和",
      |          "id": 13647
      |        },
      |        {
      |          "name": "多美鲜",
      |          "id": 13671
      |        },
      |        {
      |          "name": "未来星",
      |          "id": 10737
      |        },
      |        {
      |          "name": "/",
      |          "id": 10151
      |        },
      |        {
      |          "name": "灭菌乳",
      |          "id": 19570
      |        },
      |        {
      |          "name": "爱氏晨曦",
      |          "id": 14303
      |        },
      |        {
      |          "name": "蝶泉",
      |          "id": 14669
      |        },
      |        {
      |          "name": "旺旺",
      |          "id": 166
      |        },
      |        {
      |          "name": "旺仔牛奶",
      |          "id": 19665
      |        },
      |        {
      |          "name": "贵草",
      |          "id": 14971
      |        },
      |        {
      |          "name": "永丰",
      |          "id": 15723
      |        },
      |        {
      |          "name": "澳优乳业",
      |          "id": 17007
      |        },
      |        {
      |          "name": "德运",
      |          "id": 17028
      |        },
      |        {
      |          "name": "艾美",
      |          "id": 17377
      |        },
      |        {
      |          "name": "甘蒂牧场",
      |          "id": 17428
      |        },
      |        {
      |          "name": "德运",
      |          "id": 17450
      |        },
      |        {
      |          "name": "新希望",
      |          "id": 17480
      |        },
      |        {
      |          "name": "德亚",
      |          "id": 14309
      |        },
      |        {
      |          "name": "达利园",
      |          "id": 298
      |        },
      |        {
      |          "name": "新希望雪兰",
      |          "id": 17627
      |        },
      |        {
      |          "name": "圣牧",
      |          "id": 17630
      |        },
      |        {
      |          "name": "雪兰",
      |          "id": 17632
      |        },
      |        {
      |          "name": "多美鲜",
      |          "id": 17642
      |        },
      |        {
      |          "name": "兰特",
      |          "id": 17662
      |        },
      |        {
      |          "name": "百吉福",
      |          "id": 17689
      |        },
      |        {
      |          "name": "优乐多",
      |          "id": 17736
      |        },
      |        {
      |          "name": "慧能多",
      |          "id": 18029
      |        },
      |        {
      |          "name": "光明",
      |          "id": 18059
      |        },
      |        {
      |          "name": "延世",
      |          "id": 18153
      |        },
      |        {
      |          "name": "品利",
      |          "id": 14399
      |        },
      |        {
      |          "name": "山花",
      |          "id": 18363
      |        },
      |        {
      |          "name": "花都牧场",
      |          "id": 10316
      |        },
      |        {
      |          "name": "得乐思",
      |          "id": 14865
      |        },
      |        {
      |          "name": "罗兹姑娘",
      |          "id": 18572
      |        },
      |        {
      |          "name": "妙可",
      |          "id": 18576
      |        },
      |        {
      |          "name": "寿尔",
      |          "id": 18670
      |        },
      |        {
      |          "name": "南阳",
      |          "id": 18671
      |        },
      |        {
      |          "name": "纽麦福",
      |          "id": 18807
      |        },
      |        {
      |          "name": "伊利",
      |          "id": 17853
      |        },
      |        {
      |          "name": "天友",
      |          "id": 18921
      |        },
      |        {
      |          "name": "美汁源",
      |          "id": 267
      |        },
      |        {
      |          "name": "果粒奶优",
      |          "id": 18997
      |        },
      |        {
      |          "name": "宾格瑞",
      |          "id": 14569
      |        },
      |        {
      |          "name": "乔尼",
      |          "id": 19201
      |        },
      |        {
      |          "name": "纯牛奶",
      |          "id": 19247
      |        },
      |        {
      |          "name": "君乐宝",
      |          "id": 19013
      |        },
      |        {
      |          "name": "金凯利",
      |          "id": 19431
      |        },
      |        {
      |          "name": "捷森",
      |          "id": 17462
      |        },
      |        {
      |          "name": "贝奇",
      |          "id": 19617
      |        },
      |        {
      |          "name": "王致和",
      |          "id": 14429
      |        },
      |        {
      |          "name": "东君乳业",
      |          "id": 19642
      |        },
      |        {
      |          "name": "NANACO",
      |          "id": 19478
      |        },
      |        {
      |          "name": "农产品",
      |          "id": 19933
      |        },
      |        {
      |          "name": " 绿英宝",
      |          "id": 20164
      |        },
      |        {
      |          "name": "光明牌",
      |          "id": 12656
      |        },
      |        {
      |          "name": "圣恒",
      |          "id": 20218
      |        },
      |        {
      |          "name": "重庆市天友乳业股份有限公司",
      |          "id": 20222
      |        },
      |        {
      |          "name": "酸酸乳",
      |          "id": 20225
      |        },
      |        {
      |          "name": " 伊利",
      |          "id": 20123
      |        },
      |        {
      |          "name": "(2013)0065",
      |          "id": 13653
      |        },
      |        {
      |          "name": "dfwe12312432",
      |          "id": 20525
      |        },
      |        {
      |          "name": "cfasdfasd",
      |          "id": 20533
      |        },
      |        {
      |          "name": "百嘉",
      |          "id": 20572
      |        },
      |        {
      |          "name": "法姆莉",
      |          "id": 20573
      |        },
      |        {
      |          "name": "银宝",
      |          "id": 14657
      |        },
      |        {
      |          "name": "卓得",
      |          "id": 20598
      |        },
      |        {
      |          "name": "卓德",
      |          "id": 20599
      |        },
      |        {
      |          "name": "新康利",
      |          "id": 18545
      |        },
      |        {
      |          "name": "特仑苏",
      |          "id": 12002
      |        },
      |        {
      |          "name": "法国百吉福",
      |          "id": 10757
      |        },
      |        {
      |          "name": "嘉富",
      |          "id": 11528
      |        },
      |        {
      |          "name": "遵義",
      |          "id": 12197
      |        },
      |        {
      |          "name": "来思尔",
      |          "id": 12235
      |        },
      |        {
      |          "name": "海子",
      |          "id": 13457
      |        },
      |        {
      |          "name": "田美",
      |          "id": 10480
      |        },
      |        {
      |          "name": "Camemebert",
      |          "id": 14269
      |        },
      |        {
      |          "name": "Brie",
      |          "id": 14419
      |        },
      |        {
      |          "name": "//",
      |          "id": 19118
      |        },
      |        {
      |          "name": " 天友",
      |          "id": 19923
      |        },
      |        {
      |          "name": "Q熊",
      |          "id": 17327
      |        },
      |        {
      |          "name": "伊利",
      |          "id": 17393
      |        },
      |        {
      |          "name": "伊利舒化奶",
      |          "id": 17411
      |        },
      |        {
      |          "name": "光明",
      |          "id": 17477
      |        },
      |        {
      |          "name": "帕斯卡",
      |          "id": 17546
      |        },
      |        {
      |          "name": "达利园",
      |          "id": 17600
      |        },
      |        {
      |          "name": "伊利",
      |          "id": 17601
      |        },
      |        {
      |          "name": "小样",
      |          "id": 17737
      |        },
      |        {
      |          "name": "PASCUAI",
      |          "id": 18321
      |        },
      |        {
      |          "name": "古望坊",
      |          "id": 18533
      |        },
      |        {
      |          "name": "爱菲",
      |          "id": 18602
      |        },
      |        {
      |          "name": "葆尔",
      |          "id": 18762
      |        },
      |        {
      |          "name": "美汁源",
      |          "id": 18224
      |        },
      |        {
      |          "name": "岚台贸易有限公司",
      |          "id": 19214
      |        },
      |        {
      |          "name": "水本音",
      |          "id": 19215
      |        },
      |        {
      |          "name": "养元",
      |          "id": 12339
      |        },
      |        {
      |          "name": "味莼园",
      |          "id": 371
      |        },
      |        {
      |          "name": "津威",
      |          "id": 10148
      |        },
      |        {
      |          "name": "潮乡村",
      |          "id": 17442
      |        },
      |        {
      |          "name": "潮乡源",
      |          "id": 19388
      |        },
      |        {
      |          "name": "蒙牛优益C",
      |          "id": 10223
      |        },
      |        {
      |          "name": "野谷草",
      |          "id": 20594
      |        },
      |        {
      |          "name": "多美滋",
      |          "id": 10105
      |        },
      |        {
      |          "name": "贝因美",
      |          "id": 10145
      |        },
      |        {
      |          "name": "雅士利",
      |          "id": 325
      |        },
      |        {
      |          "name": "国台",
      |          "id": 369
      |        },
      |        {
      |          "name": "山里妹",
      |          "id": 17005
      |        },
      |        {
      |          "name": "脱脂乳粉",
      |          "id": 18484
      |        },
      |        {
      |          "name": "儿童乳粉",
      |          "id": 18050
      |        },
      |        {
      |          "name": "澳优海普诺凯",
      |          "id": 10393
      |        },
      |        {
      |          "name": "婴幼儿配方乳粉",
      |          "id": 18033
      |        },
      |        {
      |          "name": "全脂乳粉",
      |          "id": 18454
      |        },
      |        {
      |          "name": "孕产妇乳粉",
      |          "id": 18051
      |        },
      |        {
      |          "name": "雅培",
      |          "id": 10090
      |        },
      |        {
      |          "name": "太子乐",
      |          "id": 12797
      |        },
      |        {
      |          "name": "光明体智佳",
      |          "id": 12799
      |        },
      |        {
      |          "name": "明一",
      |          "id": 11112
      |        },
      |        {
      |          "name": "迪唯恩",
      |          "id": 12901
      |        },
      |        {
      |          "name": "龙丹",
      |          "id": 12899
      |        },
      |        {
      |          "name": "圣元",
      |          "id": 11439
      |        },
      |        {
      |          "name": "雅能",
      |          "id": 13068
      |        },
      |        {
      |          "name": "喜宝",
      |          "id": 10129
      |        },
      |        {
      |          "name": "味全",
      |          "id": 12903
      |        },
      |        {
      |          "name": "龙王",
      |          "id": 13139
      |        },
      |        {
      |          "name": "完达山",
      |          "id": 12552
      |        },
      |        {
      |          "name": "生命伴侣",
      |          "id": 13314
      |        },
      |        {
      |          "name": "三元",
      |          "id": 13334
      |        },
      |        {
      |          "name": "羊乐乐",
      |          "id": 13357
      |        },
      |        {
      |          "name": "雀巢",
      |          "id": 322
      |        },
      |        {
      |          "name": "——",
      |          "id": 12126
      |        },
      |        {
      |          "name": "七制",
      |          "id": 10621
      |        },
      |        {
      |          "name": "阿尔发",
      |          "id": 10426
      |        },
      |        {
      |          "name": "七",
      |          "id": 14073
      |        },
      |        {
      |          "name": "维维",
      |          "id": 255
      |        },
      |        {
      |          "name": "飞鹤",
      |          "id": 11120
      |        },
      |        {
      |          "name": "育乐",
      |          "id": 14875
      |        },
      |        {
      |          "name": "美素佳儿",
      |          "id": 18660
      |        },
      |        {
      |          "name": "华精",
      |          "id": 10245
      |        },
      |        {
      |          "name": "惠氏",
      |          "id": 10091
      |        },
      |        {
      |          "name": "合生元",
      |          "id": 10092
      |        },
      |        {
      |          "name": "美素力",
      |          "id": 17044
      |        },
      |        {
      |          "name": "贝因美",
      |          "id": 17250
      |        },
      |        {
      |          "name": "雀巢",
      |          "id": 17337
      |        },
      |        {
      |          "name": "迈高",
      |          "id": 17340
      |        },
      |        {
      |          "name": "铭道秀",
      |          "id": 17357
      |        },
      |        {
      |          "name": "宾博",
      |          "id": 17382
      |        },
      |        {
      |          "name": "咔哇熊",
      |          "id": 17653
      |        },
      |        {
      |          "name": "麦蔻",
      |          "id": 17850
      |        },
      |        {
      |          "name": "飞鹤",
      |          "id": 17856
      |        },
      |        {
      |          "name": "明一",
      |          "id": 18152
      |        },
      |        {
      |          "name": "惠氏",
      |          "id": 18115
      |        },
      |        {
      |          "name": "合生元",
      |          "id": 18190
      |        },
      |        {
      |          "name": "雅培",
      |          "id": 18216
      |        },
      |        {
      |          "name": "海普诺凯1897",
      |          "id": 18299
      |        },
      |        {
      |          "name": "澳优海普诺凯",
      |          "id": 18302
      |        },
      |        {
      |          "name": "澳优·海普诺凯",
      |          "id": 18303
      |        },
      |        {
      |          "name": "伊利",
      |          "id": 18306
      |        },
      |        {
      |          "name": "美赞臣",
      |          "id": 18411
      |        },
      |        {
      |          "name": "亨氏",
      |          "id": 18245
      |        },
      |        {
      |          "name": "蜡笔小新",
      |          "id": 288
      |        },
      |        {
      |          "name": "鹰牌",
      |          "id": 18189
      |        },
      |        {
      |          "name": "徐福记",
      |          "id": 10897
      |        },
      |        {
      |          "name": "安佳",
      |          "id": 14267
      |        },
      |        {
      |          "name": "蒙牛",
      |          "id": 17456
      |        },
      |        {
      |          "name": "伊利",
      |          "id": 17499
      |        },
      |        {
      |          "name": "雅士利",
      |          "id": 17578
      |        },
      |        {
      |          "name": "美兰",
      |          "id": 17639
      |        },
      |        {
      |          "name": "必佳",
      |          "id": 17640
      |        },
      |        {
      |          "name": "悦购",
      |          "id": 17644
      |        },
      |        {
      |          "name": "塔拉额吉",
      |          "id": 17646
      |        },
      |        {
      |          "name": "艾美",
      |          "id": 17656
      |        },
      |        {
      |          "name": "爱乐薇",
      |          "id": 17660
      |        },
      |        {
      |          "name": "总统",
      |          "id": 17635
      |        },
      |        {
      |          "name": "快乐牛",
      |          "id": 17691
      |        },
      |        {
      |          "name": "百吉福",
      |          "id": 13909
      |        },
      |        {
      |          "name": "安佳",
      |          "id": 17637
      |        },
      |        {
      |          "name": "徐福记",
      |          "id": 17719
      |        },
      |        {
      |          "name": "银宝",
      |          "id": 18088
      |        },
      |        {
      |          "name": "爱氏晨曦",
      |          "id": 18091
      |        },
      |        {
      |          "name": "快乐牛",
      |          "id": 14265
      |        },
      |        {
      |          "name": "总统牌",
      |          "id": 14853
      |        },
      |        {
      |          "name": "上海高夫食品有限公司",
      |          "id": 19285
      |        },
      |        {
      |          "name": "BIGM",
      |          "id": 19407
      |        },
      |        {
      |          "name": "天津三品",
      |          "id": 19400
      |        },
      |        {
      |          "name": "爱尔兰",
      |          "id": 19433
      |        },
      |        {
      |          "name": "莎莎亚",
      |          "id": 13007
      |        },
      |        {
      |          "name": "白吉福",
      |          "id": 14259
      |        },
      |        {
      |          "name": "营优",
      |          "id": 20062
      |        },
      |        {
      |          "name": "草原情",
      |          "id": 18003
      |        },
      |        {
      |          "name": "草原情",
      |          "id": 18018
      |        },
      |        {
      |          "name": "澳优",
      |          "id": 10170
      |        },
      |        {
      |          "name": "高钙营养乳粉",
      |          "id": 18478
      |        },
      |        {
      |          "name": "和路雪",
      |          "id": 97
      |        },
      |        {
      |          "name": "英氏",
      |          "id": 13048
      |        },
      |        {
      |          "name": "智贝拉",
      |          "id": 13269
      |        },
      |        {
      |          "name": "欧比佳",
      |          "id": 13273
      |        },
      |        {
      |          "name": "唐安",
      |          "id": 13971
      |        },
      |        {
      |          "name": "宝利氏",
      |          "id": 14559
      |        },
      |        {
      |          "name": "WISSUN/明一",
      |          "id": 20190
      |        },
      |        {
      |          "name": "芋头番薯",
      |          "id": 18603
      |        },
      |        {
      |          "name": "洋派",
      |          "id": 19526
      |        },
      |        {
      |          "name": "维他奶",
      |          "id": 20085
      |        },
      |        {
      |          "name": "台湾省农会",
      |          "id": 20616
      |        }
      |      ]
      }

    """.stripMargin

  def main(args: Array[String]): Unit = {


   //  val x: Long = null

    /*
    val s = String.format(" %-70s 已创建", s""" "space:table" """)
    val s1 = String.format(" %-70s 已创建", s""" "adasdasdasdasdaspace:dasdasdasfsfsfafdasdtable" """)
    println(s)
    println(s1)

    val gson = new Gson()
    val obj: BusinessBrandList = gson.fromJson(json, classOf[BusinessBrandList])
    println(obj.businessBrandList.size)

    obj.businessBrandList.sortBy(_.name).foreach(t => println(t.name + " : " + t.id))
    */


/*
    val list = ArrayBuffer[() => Unit]()
    list.append(f1)
    list.append(f2)
    list.append(f3)

    for (f <- list)
      f()
      */
  }

  def FromJson2Object(json: String): Unit ={

  }



  def f1(): Unit = {
    println("I am f1")
  }

  def f2(): Unit = {
    println("I am f2")
  }

  def f3(): Unit = {
    println("I am f3")
  }

}

case class Brand(name: String, id: Int)
case class BusinessBrandList(businessBrandList: Array[Brand])

